CSI API ETABS v1
cAreaObj.SetDiaphragm Method
 Assigns a diaphragm to a specified area object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDiaphragm(
	string Name,
	string DiaphragmName
)
Function SetDiaphragm (
	Name As String,
	DiaphragmName As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim DiaphragmName As String
Dim returnValue As Integer
returnValue = instance.SetDiaphragm(Name,
	DiaphragmName)
int SetDiaphragm(
	String^ Name,
	String^ DiaphragmName
)
abstract SetDiaphragm :
        Name : string *
        DiaphragmName : string -> int
Parameters
Name
Type: System.String
 The name of an existing area object
DiaphragmName
Type: System.String
 This the name of an existing diaphragm to be assigned to the specified area object. If it is "None", no diaphragm will be assigned to the area object.
Return Value
Type: Int32
 Returns zero if the diaphragm is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim DiaphragmName As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define a new diaphragm
    ret = SapModel.Diaphragm.SetDiaphragm("MyDiaph1A", SemiRigid:=True)
'assign diaphragm to area
    ret = SapModel.AreaObj.SetDiaphragm("4", "MyDiaph1A")
'get area diaphragm assignment
    ret = SapModel.AreaObj.GetDiaphragm("4", DiaphragmName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace